arzh_loadTest/put_grpc_ack_2.txt
Running 30s test @ http://localhost:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 81.928ms, rate sampling interval: 741ms
  Thread calibration: mean lat.: 81.799ms, rate sampling interval: 748ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.42ms  537.44us   6.77ms   74.74%
    Req/Sec    98.88     23.55   132.00     50.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.38ms
 75.000%    2.72ms
 90.000%    3.04ms
 99.000%    3.81ms
 99.900%    6.56ms
 99.990%    6.78ms
 99.999%    6.78ms
100.000%    6.78ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.064     0.000000            1         1.00
       1.827     0.100000          390         1.11
       1.990     0.200000          780         1.25
       2.131     0.300000         1171         1.43
       2.261     0.400000         1560         1.67
       2.377     0.500000         1955         2.00
       2.437     0.550000         2155         2.22
       2.493     0.600000         2340         2.50
       2.561     0.650000         2543         2.86
       2.631     0.700000         2735         3.33
       2.717     0.750000         2930         4.00
       2.757     0.775000         3023         4.44
       2.803     0.800000         3121         5.00
       2.855     0.825000         3218         5.71
       2.901     0.850000         3317         6.67
       2.967     0.875000         3414         8.00
       3.005     0.887500         3465         8.89
       3.041     0.900000         3514        10.00
       3.065     0.912500         3561        11.43
       3.117     0.925000         3609        13.33
       3.169     0.937500         3657        16.00
       3.187     0.943750         3681        17.78
       3.217     0.950000         3705        20.00
       3.255     0.956250         3730        22.86
       3.305     0.962500         3756        26.67
       3.377     0.968750         3779        32.00
       3.415     0.971875         3791        35.56
       3.441     0.975000         3803        40.00
       3.487     0.978125         3816        45.71
       3.545     0.981250         3827        53.33
       3.609     0.984375         3840        64.00
       3.643     0.985938         3846        71.11
       3.729     0.987500         3852        80.00
       3.791     0.989062         3858        91.43
       3.833     0.990625         3864       106.67
       3.951     0.992188         3870       128.00
       4.021     0.992969         3873       142.22
       4.099     0.993750         3876       160.00
       4.407     0.994531         3879       182.86
       5.079     0.995313         3882       213.33
       5.367     0.996094         3885       256.00
       5.407     0.996484         3887       284.44
       5.475     0.996875         3888       320.00
       6.139     0.997266         3890       365.71
       6.267     0.997656         3891       426.67
       6.311     0.998047         3894       512.00
       6.311     0.998242         3894       568.89
       6.311     0.998437         3894       640.00
       6.479     0.998633         3895       731.43
       6.563     0.998828         3896       853.33
       6.607     0.999023         3897      1024.00
       6.607     0.999121         3897      1137.78
       6.607     0.999219         3897      1280.00
       6.751     0.999316         3899      1462.86
       6.751     0.999414         3899      1706.67
       6.751     0.999512         3899      2048.00
       6.751     0.999561         3899      2275.56
       6.751     0.999609         3899      2560.00
       6.751     0.999658         3899      2925.71
       6.751     0.999707         3899      3413.33
       6.775     0.999756         3900      4096.00
       6.775     1.000000         3900          inf
#[Mean    =        2.419, StdDeviation   =        0.537]
#[Max     =        6.772, Total count    =         3900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.00s, 524.33KB read
Requests/sec:    200.05
Transfer/sec:     17.48KB