arzh_loadTest/put_rendezvous.txt
Running 30s test @ http://localhost:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 8.398ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 13.527ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.23ms  775.85us   6.96ms   68.28%
    Req/Sec   104.51    109.54   333.00     80.32%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.25ms
 75.000%    2.75ms
 90.000%    3.16ms
 99.000%    4.23ms
 99.900%    5.20ms
 99.990%    6.96ms
 99.999%    6.96ms
100.000%    6.96ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.393     0.000000            1         1.00
       1.196     0.100000          390         1.11
       1.546     0.200000          781         1.25
       1.812     0.300000         1170         1.43
       2.036     0.400000         1561         1.67
       2.251     0.500000         1952         2.00
       2.345     0.550000         2149         2.22
       2.447     0.600000         2341         2.50
       2.547     0.650000         2538         2.86
       2.647     0.700000         2730         3.33
       2.751     0.750000         2927         4.00
       2.809     0.775000         3026         4.44
       2.873     0.800000         3125         5.00
       2.939     0.825000         3218         5.71
       3.001     0.850000         3315         6.67
       3.087     0.875000         3415         8.00
       3.125     0.887500         3462         8.89
       3.165     0.900000         3510        10.00
       3.237     0.912500         3559        11.43
       3.307     0.925000         3608        13.33
       3.389     0.937500         3658        16.00
       3.431     0.943750         3682        17.78
       3.475     0.950000         3706        20.00
       3.515     0.956250         3730        22.86
       3.579     0.962500         3754        26.67
       3.669     0.968750         3779        32.00
       3.717     0.971875         3792        35.56
       3.755     0.975000         3803        40.00
       3.813     0.978125         3815        45.71
       3.887     0.981250         3827        53.33
       3.977     0.984375         3840        64.00
       4.035     0.985938         3846        71.11
       4.093     0.987500         3852        80.00
       4.195     0.989062         3858        91.43
       4.263     0.990625         3864       106.67
       4.383     0.992188         3870       128.00
       4.435     0.992969         3873       142.22
       4.467     0.993750         3877       160.00
       4.551     0.994531         3879       182.86
       4.611     0.995313         3882       213.33
       4.727     0.996094         3885       256.00
       4.787     0.996484         3887       284.44
       4.799     0.996875         3888       320.00
       4.891     0.997266         3890       365.71
       4.919     0.997656         3893       426.67
       4.919     0.998047         3893       512.00
       5.003     0.998242         3894       568.89
       5.003     0.998437         3894       640.00
       5.103     0.998633         3895       731.43
       5.199     0.998828         3896       853.33
       5.519     0.999023         3898      1024.00
       5.519     0.999121         3898      1137.78
       5.519     0.999219         3898      1280.00
       5.519     0.999316         3898      1462.86
       5.519     0.999414         3898      1706.67
       5.559     0.999512         3899      2048.00
       5.559     0.999561         3899      2275.56
       5.559     0.999609         3899      2560.00
       5.559     0.999658         3899      2925.71
       5.559     0.999707         3899      3413.33
       6.963     0.999756         3900      4096.00
       6.963     1.000000         3900          inf
#[Mean    =        2.234, StdDeviation   =        0.776]
#[Max     =        6.960, Total count    =         3900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6002 requests in 30.00s, 468.91KB read
Requests/sec:    200.04
Transfer/sec:     15.63KB