arzh_loadTest/put_results.txt
Running 30s test @ http://localhost:8080
  1 threads and 1 connections
  Thread calibration: mean lat.: 249.898ms, rate sampling interval: 2152ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.52ms  691.26us  21.31ms   86.65%
    Req/Sec   199.44      0.50   200.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.46ms
 75.000%    1.76ms
 90.000%    2.15ms
 99.000%    2.85ms
 99.900%    7.81ms
 99.990%   21.33ms
 99.999%   21.33ms
100.000%   21.33ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.401     0.000000            1         1.00
       0.929     0.100000          401         1.11
       1.090     0.200000          803         1.25
       1.219     0.300000         1200         1.43
       1.339     0.400000         1600         1.67
       1.457     0.500000         2001         2.00
       1.513     0.550000         2205         2.22
       1.567     0.600000         2402         2.50
       1.630     0.650000         2602         2.86
       1.689     0.700000         2802         3.33
       1.766     0.750000         3001         4.00
       1.809     0.775000         3100         4.44
       1.858     0.800000         3203         5.00
       1.920     0.825000         3300         5.71
       1.992     0.850000         3401         6.67
       2.071     0.875000         3502         8.00
       2.115     0.887500         3552         8.89
       2.155     0.900000         3600        10.00
       2.191     0.912500         3651        11.43
       2.241     0.925000         3703        13.33
       2.305     0.937500         3751        16.00
       2.341     0.943750         3776        17.78
       2.373     0.950000         3801        20.00
       2.425     0.956250         3826        22.86
       2.473     0.962500         3850        26.67
       2.537     0.968750         3875        32.00
       2.569     0.971875         3887        35.56
       2.601     0.975000         3901        40.00
       2.629     0.978125         3912        45.71
       2.667     0.981250         3925        53.33
       2.723     0.984375         3937        64.00
       2.767     0.985938         3943        71.11
       2.807     0.987500         3950        80.00
       2.831     0.989062         3956        91.43
       2.867     0.990625         3962       106.67
       2.881     0.992188         3969       128.00
       2.887     0.992969         3971       142.22
       2.921     0.993750         3975       160.00
       2.969     0.994531         3978       182.86
       3.007     0.995313         3981       213.33
       3.087     0.996094         3984       256.00
       3.155     0.996484         3985       284.44
       3.217     0.996875         3987       320.00
       5.579     0.997266         3989       365.71
       5.835     0.997656         3990       426.67
       6.519     0.998047         3992       512.00
       6.519     0.998242         3992       568.89
       6.899     0.998437         3993       640.00
       7.563     0.998633         3994       731.43
       7.807     0.998828         3995       853.33
      12.175     0.999023         3996      1024.00
      12.175     0.999121         3996      1137.78
      12.175     0.999219         3996      1280.00
      12.215     0.999316         3997      1462.86
      12.215     0.999414         3997      1706.67
      16.847     0.999512         3998      2048.00
      16.847     0.999561         3998      2275.56
      16.847     0.999609         3998      2560.00
      16.847     0.999658         3998      2925.71
      16.847     0.999707         3998      3413.33
      21.327     0.999756         3999      4096.00
      21.327     1.000000         3999          inf
#[Mean    =        1.518, StdDeviation   =        0.691]
#[Max     =       21.312, Total count    =         3999]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6001 requests in 30.00s, 468.83KB read
Requests/sec:    200.02
Transfer/sec:     15.63KB